emacs-init.org
#+TITLE: My Special Emacs Configuration
#+AUTHOR: logan mohseni
#+EMAIL: mohsenil85@gmail.com 
#+PROPERTY: header-args :tangle init.el


* frontmatter
** straight
#+BEGIN_SRC emacs-lisp :results output silent

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

  (use-package no-littering :ensure t)
  ;; (load-file "~/.emacs.d/org-init.el")


  ;; ;;used in debugging
  ;; ;;(use-package evil :ensure t :config (evil-mode 1))
  ;; ;;(setq debug-on-error t)

  ;; ;;(use-package org :ensure t)	

  ;; ;;(straight-use-package 'org)
  ;; (require 'ob-tangle)


  ;; (org-babel-load-file
  ;;  (expand-file-name "emacs-init.org"
  ;; 		   user-emacs-directory))
#+END_SRC

** org-mode
   
#+BEGIN_SRC emacs-lisp :results output silent

  (use-package org 

    :ensure
    :diminish 
    :config
    (progn
      (add-to-list 'org-modules 'org-habit)
      (add-to-list 'org-modules 'org-crypt)

      (setq org-M-RET-may-split-line nil)
      (setq org-agenda-files '("~/org/"))
      (setq org-agenda-ndays 1)
      (setq org-agenda-show-all-dates t)
      (setq org-agenda-show-inherited-tags 'always)
      (setq org-agenda-skip-deadline-if-done t)
      (setq org-agenda-skip-scheduled-if-done t)
      (setq org-agenda-start-on-weekday nil)
      (setq org-agenda-todo-ignore-with-date t) ;hide shed. and deadlined from global todo 
      (setq org-agenda-start-with-follow-mode nil)
      (setq org-agenda-text-search-extra-files '(agenda-archives))
      (setq org-catch-invisible-edits t)
      (setq org-deadline-warning-days 14)
      (setq org-default-notes-file "~/org/main.org")
      (setq org-edit-src-persistent-message nil)
      (setq org-enforce-todo-checkbox-dependencies t)
      (setq org-enforce-todo-dependencies t)
      (setq org-indent-mode t)
      (setq org-log-done 'time)
      (setq org-log-into-drawer t)
      (setq org-log-redeadline (quote time))
      (setq org-log-reschedule (quote time))
      (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
      (setq org-mobile-inbox-for-pull "~/org/inbox.org")
      ;;; interfered with dropbox sync
      ;;;(setq org-mobile-use-encryption t  )
      ;; org-mobile-encryption-password  set in secrets.el.gpg
      (setq org-outline-path-complete-in-steps nil)
      ;;(setq org-refile-allow-creating-parent-nodes (quote confirm)) ;
      ;;(setq org-refile-targets (quote ((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))))
      ;;(setq org-refile-use-outline-path 'buffer-name)
      (setq org-return-follows-link t)
      (setq org-reverse-note-order t)
      (setq org-show-hierarchy-above (quote ((default . t))))
      (setq org-show-siblings (quote ((default) (isearch) (bookmark-jump))))
      (setq org-use-tag-inheritance t)


  					  ;(setq org-hide-leading-stars t)


      (setq org-todo-keywords
  	    (quote ((sequence "TODO(t)" "NEXT(n)" "|"  "DONE(d!)")
  		    (sequence "WAITING(w@/!)" "|" "SOMEDAY(s)" "CANCELLED(c@/!)")
  		    )))

      (setq org-capture-templates
  	    (quote (("t" "todo" entry (file "~/org/inbox.org" )
  		     "* TODO  %? :FLAGGED:\n%U\n%a\n" )

  		    ("f" "fiction" entry (file+headline "~/org/serial-structure.org" "ideas")
  		     "* %? :NOTE:\n%U\n%a\n" )
  		    ("n" "note" entry (file+headline "~/org/notes.org" "notes")
  		     "* %? :NOTE:\n%U\n%a\n" )
  		    ;; ("i" "idea" entry (file+headline "~/org/notes.org" "ideas")
  		    ;;  "* %?\n" )
  		    ;; ("n" "information" entry (file+headline "~/org/index.org" "information")
  		    ;;  "* %?\n" )
  		    ("s" "shopping" checkitem
  		     (file+headline "~/org/main.org" "shopping ")
  		     "- [ ] %?\n")
  		    ("r" "rss" entry
  		     (file+olp "~/Dropbox/elfeed.org" "feeds" "captures")
  		     "*** %^C\n")
  		    ("j" "journal" entry (file+datetree "~/org/notes.org")
  		     "* %?\n %U\n  %i\n  %a")
  		    ("w" "work" entry (file+datetree "~/org/work.org")
  		     "* %?\n %U\n  %i\n  %a")
  		    )))  




      ;; Targets include this file and any file contributing to the agenda - up to 9 levels deep
      ;;

  					  ;(defvar my-org-mobile-sync-timer nil)

  					  ;(defvar my-org-mobile-sync-secs (* 60 20))

      ;; (defun my-org-mobile-sync-pull-and-push ()
      ;;   (org-mobile-pull)
      ;;   (org-mobile-push)
      ;;   (when (fboundp 'sauron-add-event)
      ;; 	(sauron-add-event 'my 3 "Called org-mobile-pull and org-mobile-push")))

      ;; (defun my-org-mobile-sync-start ()
      ;;   "Start automated `org-mobile-push'"
      ;;   (interactive)
      ;;   (setq my-org-mobile-sync-timer
      ;; 	    (run-with-idle-timer my-org-mobile-sync-secs t
      ;; 				 'my-org-mobile-sync-pull-and-push)))

      ;; (defun my-org-mobile-sync-stop ()
      ;;   "Stop automated `org-mobile-push'"
      ;;   (interactive)
      ;;   (cancel-timer my-org-mobile-sync-timer))

      ;; (my-org-mobile-sync-start)

      )
    :bind (
  	   ("C-c l" . org-store-link)
  	   ("C-c a" . org-agenda)
  	   ("C-c b" . org-switchb)
  	   ("C-c c" . org-capture)
  	   ))

  ;; (with-eval-after-load "org-mode"
  ;;      (evil-org-mode 1)
  ;;      )


  (with-eval-after-load "org-agenda" 
    (define-key org-agenda-mode-map (kbd "J") 'org-agenda-goto-date) 
    (define-key org-agenda-mode-map (kbd "j") 'evil-next-line) 
    (define-key org-agenda-mode-map (kbd "k") 'evil-previous-line) 

    )



  ;;put all DONE into archive
  (defun my-org-archive-done-tasks ()
    (interactive)
    (unless
  	(org-map-entries 'org-archive-subtree "/DONE" 'file)))


  ;; (add-hook 'org-mode-hook
  ;;           (lambda ()
  ;;             (add-hook 'after-save-hook 'my-org-archive-done-tasks 'make-it-local)))


  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (lisp . t)
     (shell . t)
     (python . t)
     ))

#+END_SRC
** diminish
#+BEGIN_SRC emacs-lisp :results output silent
  ;  (evil-org-mode 1)

  (use-package diminish :ensure t)
#+END_SRC

** evil
*** main evil
    
#+BEGIN_SRC emacs-lisp :results output silent

  ;;done in the earlier init.el
  ;;(use-package evil :ensure t :config (evil-mode 1))

  (use-package evil
    :ensure t
    :init
    ;;turn on for evil collection
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-redo)
  
    )

  (use-package evil-collection
    :after evil
    :diminish
    :ensure t
    :config
    (setq evil-collection-want-unimpaired-p nil)
    (evil-collection-init)
    )



  ;; (use-package evil-visual-mark-mode
  ;;   :ensure t
  ;;   :config
  ;;   (evil-visual-mark-mode 1))

#+END_SRC
*** evil-org
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () (evil-org-mode +1)))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+END_SRC
    

* packages
** ag

#+BEGIN_SRC emacs-lisp :results output silent
  (use-package ag :ensure t :defer t :config (setq ag-highlight-search t)
    (setq ag-reuse-buffers 't))
#+END_SRC
** bind-key
#+BEGIN_SRC emacs-lisp
  (use-package bind-key
    ;; A simple way to manage personal keybindings, provided by `use-package'
    :init
    ;; If non-nil, extract docstrings from lambdas, closures and keymaps if possible.
    (setq bind-key-describe-special-forms t)
    )


#+END_SRC
** calfw & friends
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package calfw :ensure t
    :config
    (require 'calfw)
    (use-package calfw-org :ensure t
      :config
      (require 'calfw-org)
      ;;   (setq cfw:org-overwrite-default-keybinding t)
      )
    )


#+END_SRC
** company
#+BEGIN_SRC emacs-lisp :results output silent 
  (use-package company
    :ensure t
    :diminish )

      
      #+END_SRC

***

** copilot
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package copilot
    :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
    :ensure t
    ;; :hook (prog-mode . copilot-mode)	;
    :config
    (progn
      (setq copilot-expansion-delay 0.2)
      (setq copilot-expansion-limit 500)
      (setq copilot-node-executable "/Users/logan.k.mohseni/.nvm/versions/node/v16.20.2/bin/node" )
      )

    :bind (("C-c M-f" . copilot-complete)
  	 :map copilot-completion-map
  	 ("C-g" . 'copilot-clear-overlay)
  	 ("M-p" . 'copilot-previous-completion)
  	 ("M-n" . 'copilot-next-completion)
  	 ("<tab>" . 'copilot-accept-completion)
  	 ("M-f" . 'copilot-accept-completion-by-word)
  	 ("M-<return>" . 'copilot-accept-completion-by-line)))

  #+END_SRC

** dired
vinagresque
#+BEGIN_SRC emacs-lisp :results output silent

  (use-package dired
    :straight nil				;
    :bind (:map dired-mode-map 
  		(("`" . dired-toggle-read-only)
  		 ("j" .  evil-next-line)
  		 ("k" . evil-previous-line)
  		 ( "-" .  dired-up-directory)
  		 ("~" . (lambda ()(interactive) (find-alternate-file "~/")))
  		 ("RET" . dired-find-file)
  		 ("C-<return>" . dired-find-file-other-window) 
  		 ("/" . evil-search-forward) 
  		 )
  		)

    :init
    (add-to-list 'evil-emacs-state-modes 'dired-mode)
    :config
    (use-package dired+
      :straight (dired+ :fetcher url :url "https://www.emacswiki.org/emacs/download/dired+.el")
      :defer 1
      :init
      (setq diredp-hide-details-initially-flag t)
      (setq diredp-hide-details-propagate-flag t)
      :config
      (diredp-toggle-find-file-reuse-dir 1))

    )


  (eval-after-load "evil-mode"
    '(progn
       (add-to-list 'evil-emacs-state-modes 'dired-mode)
       ))

  (use-package dired-git-info
    :ensure t
    :bind (:map dired-mode-map
                (")" . dired-git-info-mode)))




#+END_SRC
** dumb-jump
#+BEGIN_SRC emacs-lisp :results output silent
  ;;re-write using M-.
  ;; (use-package dumb-jump
  ;; :ensure t 
  ;; :defer t 
  ;;   :bind (("M-g o" . dumb-jump-go-other-window)
  ;; 	 ("M-g j" . dumb-jump-go)
  ;; 	 ("M-g x" . dumb-jump-go-prefer-external)
  ;; 	 ("M-g z" . dumb-jump-go-prefer-external-other-window))
  ;;   :config (setq dumb-jump-selector 'helm)
  ;;   )

#+END_SRC
** eat term
#+BEGIN_SRC emacs-lisp :results output silent
  

(straight-use-package
 '(eat :type git
       :host codeberg
       :repo "akib/emacs-eat"
       :files ("*.el" ("term" "term/*.el") "*.texi"
               "*.ti" ("terminfo/e" "terminfo/e/*")
               ("terminfo/65" "terminfo/65/*")
               ("integration" "integration/*")
               (:exclude ".dir-locals.el" "*-tests.el"))))


#+END_SRC
** elfeed
#+BEGIN_SRC emacs-lisp :results output silent
  ;; (use-package elfeed
  ;;   :ensure t
  ;;   ;;:defer t
  ;;   :commands (elfeed-search-mode elfeed-show-mode)
  ;;   :init (progn
  ;; 	  ;; (use-package elfeed-goodies :ensure t)
  ;; 	  (use-package elfeed-org :ensure t))
  ;;   :config
  ;;   (progn
  ;;     (require 'elfeed-goodies)
  ;;     (elfeed-goodies/setup)
  ;;     (setq 
  ;;      elfeed-goodies/powerline-default-separator nil
  ;;      elfeed-goodies/entry-pane-position 'bottom)

  ;;     (setq elfeed-db-directory "~/.emacs.d/elfeed")
  ;;     (require 'elfeed-org)
  ;;     (elfeed-org)
  ;;     (setq rmh-elfeed-org-files (list "~/Dropbox/elfeed.org")))
  ;;     )



#+END_SRC
*** 
** flycheck
#+BEGIN_SRC emacs-lisp  :results output silent
  (use-package flycheck
    :ensure t
    :diminish ""
    :config
    ;; (progn
    ;;   (add-hook 'after-init-hook 'global-flycheck-mode))
    )


  (flycheck-define-checker proselint
    "A linter for prose."
    :command ("proselint" source-inplace)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ": "
	      (id (one-or-more (not (any " "))))
	      (message) line-end))
    :modes (text-mode prose-mode markdown-mode gfm-mode))

  (add-to-list 'flycheck-checkers 'proselint)

#+end_src
   
** formatter
#+BEGIN_SRC emacs-lisp
  ;; (use-package apheleia
  ;;   :ensure t
  ;;   :diminish
  ;;   :config
  ;;   (apheleia-global-mode t))
  (use-package prettier
    :ensure t
    :diminish
    :config
    (global-prettier-mode))
#+END_SRC

#+RESULTS:
: t

** general
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package general
    :ensure t   
    :defer 1   
    :config   (setq leader "SPC"))
#+END_SRC
** git-gutter
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package git-gutter
    :ensure t
    :diminish
    :config
    (global-git-gutter-mode t)

    ;; If you would like to use git-gutter.el and linum-mode
   ;; (git-gutter:linum-setup)

    ;; If you enable git-gutter-mode for some modes

    (global-set-key (kbd "C-x C-g") 'git-gutter)
    (global-set-key (kbd "C-x v =") 'git-gutter:popup-hunk)

    ;; Jump to next/previous hunk
    (global-set-key (kbd "C-x C-p") 'git-gutter:previous-hunk)
    (global-set-key (kbd "C-x C-n") 'git-gutter:next-hunk)

    (setq git-gutter:update-interval 0.2)
    ;; Stage current hunk
    (global-set-key (kbd "C-x v s") 'git-gutter:stage-hunk)

    ;; Revert current hunk
    (global-set-key (kbd "C-x v r") 'git-gutter:revert-hunk)

    ;; Mark current hunk
    (global-set-key (kbd "C-x v SPC") #'git-gutter:mark-hunk)
    )


#+END_SRC
   
** image+
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package image+
    :ensure hydra
    :defer t
    :config 
    (progn
      (eval-after-load 'image+
	`(when (require 'hydra nil t)
	   (defhydra imagex-sticky-binding (global-map "C-x C-l")
	     "Manipulating Image"
	     ("+" imagex-sticky-zoom-in "zoom in")
	     ("-" imagex-sticky-zoom-out "zoom out")
	     ("M" imagex-sticky-maximize "maximize")
	     ("O" imagex-sticky-restore-original "restore original")
	     ("S" imagex-sticky-save-image "save file")
	     ("r" imagex-sticky-rotate-right "rotate right")
	     ("l" imagex-sticky-rotate-left "rotate left"))))
      )
    )
#+END_SRC
** keyfreq
#+BEGIN_SRC emacs-lisp :results output silent
  (use-package keyfreq
    :ensure t
    :defer t
    :init
    (require 'keyfreq)
    (keyfreq-mode 1)
    (keyfreq-autosave-mode 1)

    )
#+END_SRC
   
